# CC_CircuitFromShape

## Description
Creates circuit from the given shape. The shape must be line, polygon or polyline.

```pascal
PROCEDURE CC_CircuitFromShape(hObj : HANDLE);
```

```python
def vs.CC_CircuitFromShape(hObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|   |

## Version
Availability: from Vectorworks 2022

## Category
* ConnectCAD